'use strict'
// Рекурсия - это функция которая открывает себя в себе

// пример ( Здесь показаано, что функция не имеющая размера "тела"?не точно) будет продолжаться, иными словами первая не завершаясь откроет вторую, но продолжит выполняться и так далее)
// _
// | _
// | | _
// | | | _
// | | | | _

// function recursion() {
//   recursion();
// }

// recursion();

// ===============================================================

 function factorial(n) {
  if (n === 1) {
    return 1;
  }

  return n * factorial(n - 1);
 }

console.log(factorial(5));
console.log(factorial(7));
console.log(factorial(8));
console.log(factorial(10463)); // максимальное колличество вызовов stec-ов на моём компьютере

// 5 = 5 * 4 * 3 * 2 * 1

// (120) 5! = 5 * 4!
//  (24) 4! = 4 * 3!
//   (6) 3! = 3 * 2!
//   (2) 2! = 2 * 1

console.log('===================================================');

const obj = {
  field1: '',
  field2: '',
  field3: '',
  field4: {
    field1: '',
    field2: '',
    field3: '',
    field4: {
      field1: '',
      field2: '',
      field3: ''
  }
  }
}